for (var i = 0; i < 5; i++) {
  setTimeout(function () {
    console.log(new Date(), i);
  }, 1000);
}

console.log(new Date(), i);

// 2020-12-20T10:36:14.815Z 5
// 2020-12-20T10:36:15.819Z 5
// 2020-12-20T10:36:15.820Z 5
// 2020-12-20T10:36:15.820Z 5
// 2020-12-20T10:36:15.823Z 5
// 2020-12-20T10:36:15.824Z 5

// 我们遇到面试官问你题目不要急于回答，先看看里面有什么考点
// 考点一：for循环里面用的是var。let,const 有块级作用域，var没有，所以这不是一个闭包(函数作用域和块级作用域才有闭包)
// 如果我们把var改成let，那么输出结果为
// 2020-12-20T10:40:23.418Z 0
// 2020-12-20T10:40:23.445Z 1
// 2020-12-20T10:40:23.445Z 2
// 2020-12-20T10:40:23.445Z 3
// 2020-12-20T10:40:23.446Z 4
// 考点二：执行顺序  此处用到了事件处理机制
// 先顺序执行，在执行setTimeout，setTimeout是宏任务
// setTimeout执行的时候，访问全局变量i已经变成了5,所以都输出5
// 考点三：定时器是一起执行还是执行另一个需要等前一个执行完在执行

// 在这里在抖一下书包，理解闭包一定要先理解执行上下文，还有作用域，这几个考点是相辅相成的
// 参考链接：https://juejin.cn/post/6844903474212143117
